"use strict";
// Вивести на сторінку в один рядок через кому числа від 10 до 20.

let number = [];

for (let i = 0; i <= 10; i++) {
    number[i] = i + 10  
}

console.log(number.join(", "));

// Вивести квадрати чисел від 10 до 20.


for (let i of number) {
    console.log(Math.pow(i, 2))
}

// Вивести таблицю множення на 7.

let multiplyResult = [];

const multiply = (a) => {
    for (let i = 1; i <= 10; i++) {
        multiplyResult[i - 1] = a * i;
    }
    console.log(multiplyResult.join(", "))
}

multiply(7);

// Знайти суму всіх цілих чисел від 1 до 15.

const sumFanction = (num) => {
    
    let sum = [];
    for (let i = 0; i <= num; i++) {
        sum[i] = i
    };
    console.log(sum.reduce((a, b) => {
        return a + b;
    }));

}

sumFanction(8);



// Знайти добуток усіх цілих чисел від 15 до 35.

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників.
// Знайти суму його парних дільників.
// Надрукувати повну таблицю множення від 1 до 10.
